/*
내 영양 분석 페이지 > 플래닛 지수 및 영양제 섭취 스탯
@author 조혜안
@since 2022.09.22
*/
import { Paper } from "@mui/material";

export default function NutrientState({ value }) {
  return (
    <Paper
      sx={{
        maxHeight: 500,
        borderColor: "purple.main",
        color: "#747373",
        overflow: "auto",
      }}
      variant="outlined"
    >
      {/* 최근 7일이면 0, 최근 30일이면 1, 전체 기간이면 2 */}
      {/* {value} */}
      <div style={{ margin: 20 }}>
        <h3>나의 플래닛 지수</h3>
        여긴 최근 7일 화면의 플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <h3>영양제 Check</h3>
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
        플래닛 지수 및 영양제 섭취 스탯 영역입니당
        <br />
      </div>
    </Paper>
  );
}
